v1/rails_projects/proj2/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    @list_of_articles = Article.all

INSERT INTO "articles" ("title", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "another"], ["created_at", "2024-03-23 22:20:32.984574"], ["updated_at", "2024-03-23 22:20:32.984574"], ["description", "wow this works!"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save

UPDATE "articles" SET "updated_at" = ?, "description" = ? WHERE "articles"."id" = ?  [["updated_at", "2024-03-23 23:03:11.761895"], ["description", "wow this works!edfswfr"], ["id", 14]]
---
  def update
    if @article.update(article_params)